<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"884da32c5ec99ce4d9ebc144b72f35dcbf4ac2d741d3703b28fb7952628e40b0","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #733 at https://github.com/cal-itp/data-infra/actions/runs/18147829053","plan_out_hash":"d6907899b0078a27ce0431841f3111b3b8cdd5f8a57f4eb9b8947b9607aba747","plan_hash":"8d1bf19690ce2d1bf5c73883b14872ec9d1d328f8ede7bb4d47071dc74be14cf","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["models/docs/_docs_kuba.md"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/docs/_docs_kuba.md"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/docs/_docs_kuba.md"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/kuba/_mart_kuba.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "d3qtsQ==" -> (known after apply)
!~      detect_md5hash      = "kG0mo1iupwuRDMrbrpqNGQ==" -> "different hash"
!~      generation          = 1755538683548475 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/kuba/_mart_kuba.yml"
!~      md5hash             = "kG0mo1iupwuRDMrbrpqNGQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/kuba/_mart_kuba.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/kuba/_src.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "VFjYpg==" -> (known after apply)
!~      detect_md5hash      = "d+eUGgQXAgoXWUQWdd4hHg==" -> "different hash"
!~      generation          = 1755538683298627 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/kuba/_src.yml"
!~      md5hash             = "d+eUGgQXAgoXWUQWdd4hHg==" -> (known after apply)
        name                = "data/warehouse/models/staging/kuba/_src.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/kuba/_stg_kuba.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "miAjOg==" -> (known after apply)
!~      detect_md5hash      = "CamznsHDddRab5WaAcJWHw==" -> "different hash"
!~      generation          = 1755538683306766 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/kuba/_stg_kuba.yml"
!~      md5hash             = "CamznsHDddRab5WaAcJWHw==" -> (known after apply)
        name                = "data/warehouse/models/staging/kuba/_stg_kuba.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/kuba/stg_kuba__device_properties.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "3sBNiw==" -> (known after apply)
!~      detect_md5hash      = "2Bh22L1CtVu1vqQyft0FVg==" -> "different hash"
!~      generation          = 1755538683241321 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/kuba/stg_kuba__device_properties.sql"
!~      md5hash             = "2Bh22L1CtVu1vqQyft0FVg==" -> (known after apply)
        name                = "data/warehouse/models/staging/kuba/stg_kuba__device_properties.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #733](https://github.com/cal-itp/data-infra/actions/runs/18147829053)